Revit 2026 API

# ProfileTransformed Property

---

Transforms this profile and returns the result.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Profile this[
	Transform transform
] { get; }
```
```vb
Public ReadOnly Property Transformed (
	transform As Transform
) As Profile
	Get
```
```cpp
public:
property Profile^ Transformed[Transform^ transform] {
	Profile^ get (Transform^ transform);
}
```
```fsharp
member Transformed : Profile with get
```

#### Parameters

transform Transform
    The transformation used to transform the profile.

#### Return Value

ProfileThe transformed profile.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the handle of the specified transformation is . |
| InvalidOperationException | Thrown when failed to transform a curve in the profile. |

Transforms all the curves that define the boundary of this profile.

#### Reference

Profile Class

Autodesk.Revit.DB Namespace